### Project Name: Olympics Analysis

- Sports goes into entertainment category as far as viewers are concerned.Olympic athletes are considered as benchmarks in regards with their Strength, Agility and Intelligence.
- Goal is to explore a dataset on the modern summer Olympic Games, from Athens 1896 to Rio 2016 and try to find hidden patterns, actionable insights from summer olympics dataset taken from Kaggle.
- Basically dataset have records which corresponds to an individual athlete competing in an individual Olympic event such as name,age,medal_won and so on.

Using Zomato dataset we try to find out following questions answer:

In [70]:
# importing Basic libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [71]:
import mysql.connector

mydb=mysql.connector.connect(
host="localhost",
user="root",
password="Sangeeta@4820",
use_pure=True)

In [72]:
import pandas as pd

In [73]:
query = '''SELECT * FROM Olympics.olympics_history'''

In [74]:
df = pd.read_sql_query(query, mydb)

In [75]:
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24,180,80,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NA
1,2,A Lamusi,M,23,170,60,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NA
2,3,Gunnar Nielsen Aaby,M,24,NA,NA,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NA
3,4,Edgar Lindenau Aabye,M,34,NA,NA,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21,185,82,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NA

In [78]:
df.Year.unique()

array([1992, 2012, 1920, 1900, 1988, 1994, 1932, 2002, 1952, 1980, 2000,
       1996, 1912, 1924, 2014, 1948, 1998, 2006, 2008, 2016, 2004, 1960,
       1964, 1984, 1968, 1972, 1936, 1956, 1928, 1976, 2010, 1904, 1906,
       1908, 1896])

In [76]:
nan_data= df.replace('NA', np.nan)

In [77]:
nan_data.isnull().sum()

ID             0
Name           0
Sex            0
Age            0
Height     51402
Weight     54074
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     222153
dtype: int64

In [63]:
query2 ='''SELECT * FROM Olympics.olympics_history_noc_regions'''

In [64]:
df = pd.read_sql_query(query2, mydb)

In [65]:
df.head()

   NOC       region                 notes
0  AFG  Afghanistan
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

In [67]:
df.isnull().sum()

NOC       0
region    0
notes     0
dtype: int64

In [69]:
df

     NOC       region                 notes
0    AFG  Afghanistan
1    AHO      Curacao  Netherlands Antilles
2    ALB      Albania
3    ALG      Algeria
4    AND      Andorra
..   ...          ...                   ...
225  YEM        Yemen
226  YMD        Yemen           South Yemen
227  YUG       Serbia            Yugoslavia
228  ZAM       Zambia
229  ZIM     Zimbabwe

[230 rows x 3 columns]